Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
// N-Bus ESP32-C3 firmware — passively reads a Büttner/Dometic NDS "N-Bus" (LIN,
// 19200 baud) and republishes values over MQTT with Home Assistant auto-discovery,
// WiFiManager provisioning and ElegantOTA web updates.
//
// SAFETY: read-only. The LIN UART is opened RX-only (TX pin = -1). Never transmit.
//
// Board: ESP32-C3 Super Mini  ·  FQBN esp32:esp32:esp32c3 (USB CDC On Boot enabled).

#include <Preferences.h>
#include <WebServer.h>
#include <LittleFS.h>
#include <WiFi.h>
#include <WiFiManager.h>     // tzapu
#include <PubSubClient.h>    // knolleary
#include <ArduinoJson.h>     // bblanchon (v7)
#include <ElegantOTA.h>      // ayushsharma82
#include "esp_mac.h"
#include "esp_system.h"
#include "esp_task_wdt.h"

#include "Config.h"
#include "NBusParser.h"

// Print raw frame windows and decoded registers over USB serial. Comment out once the
// bus is fully mapped; the raw dump is what makes unknown registers visible.
#define NBUS_DEBUG 1

// --------------------------------------------------------------------------
// Globals
// --------------------------------------------------------------------------
// Declared up here rather than beside the ring-buffer code that uses it: the .ino
// preprocessor hoists generated prototypes to the top of the file, so any type
// named in a function signature must already exist before the first function.
struct RawEntry {
  uint32_t ms;
  uint8_t  d[8];   // NAD PCI SID reg d0 d1 d2 d3 — checksum already verified, so not stored
};

HardwareSerial   LinSerial(NBUS_UART_NUM);
NBusParser       parser;
Preferences      prefs;
WiFiClient       wifiClient;
PubSubClient     mqtt(wifiClient);
WebServer        httpServer(80);

// The portal runs non-blocking, so WiFiManager and its parameters must outlive
// startProvisioning() — it keeps pointers to them and services them from loop().
WiFiManager           wm;
WiFiManagerParameter  pHost("host", "MQTT host", "", 64);
WiFiManagerParameter  pPort("port", "MQTT port", "", 8);
WiFiManagerParameter  pUser("user", "MQTT user", "", 48);
WiFiManagerParameter  pPass("pass", "MQTT password", "", 48);
WiFiManagerParameter  pBase("base", "Base topic", "", 32);
WiFiManagerParameter  pOtaU("otau", "OTA user (optional)", "", 32);
WiFiManagerParameter  pOtaP("otap", "OTA password (optional)", "", 32);

struct MqttConfig {
  String host;
  uint16_t port = 1883;
  String user;
  String pass;
  String base;       // base topic, e.g. "nbus"
  String otaUser;
  String otaPass;
} cfg;

bool g_shouldSaveConfig = false;
bool g_portalActive     = false;
bool g_netServicesUp    = false;

// Per-group last-seen timestamps for staleness.
uint32_t g_lastBattMs    = 0;
uint32_t g_lastSolarMs   = 0;
uint32_t g_lastStarterMs = 0;
uint32_t g_lastCellMs    = 0;

uint32_t g_lastPublishMs   = 0;
uint32_t g_lastMqttTryMs   = 0;
uint32_t g_lastHeartbeatMs = 0;
bool     g_discoverySent   = false;
uint8_t  g_mqttFailCount   = 0;

// --------------------------------------------------------------------------
// LED helpers
// --------------------------------------------------------------------------
static inline void ledWrite(bool on) {
#if NBUS_LED_ACTIVE_LOW
  digitalWrite(NBUS_LED_PIN, on ? LOW : HIGH);
#else
  digitalWrite(NBUS_LED_PIN, on ? HIGH : LOW);
#endif
}

// --------------------------------------------------------------------------
// Persistent config (NVS)
// --------------------------------------------------------------------------
void loadConfig() {
  prefs.begin("nbus", true);
  cfg.host    = prefs.getString("host", NBUS_DEFAULT_MQTT_HOST);
  cfg.port    = prefs.getString("port", NBUS_DEFAULT_MQTT_PORT).toInt();
  cfg.user    = prefs.getString("user", NBUS_DEFAULT_MQTT_USER);
  cfg.pass    = prefs.getString("pass", NBUS_DEFAULT_MQTT_PASS);
  cfg.base    = prefs.getString("base", NBUS_DEFAULT_BASE_TOPIC);
  cfg.otaUser = prefs.getString("otau", "");
  cfg.otaPass = prefs.getString("otap", "");
  prefs.end();
  if (cfg.port == 0) cfg.port = 1883;
  if (cfg.base.isEmpty()) cfg.base = NBUS_DEFAULT_BASE_TOPIC;
}

void saveConfig() {
  prefs.begin("nbus", false);
  prefs.putString("host", cfg.host);
  prefs.putString("port", String(cfg.port));
  prefs.putString("user", cfg.user);
  prefs.putString("pass", cfg.pass);
  prefs.putString("base", cfg.base);
  prefs.putString("otau", cfg.otaUser);
  prefs.putString("otap", cfg.otaPass);
  prefs.end();
}

// --------------------------------------------------------------------------
// Wi-Fi provisioning
// --------------------------------------------------------------------------
bool mqttConnect();
void onWifiUp();

void onSaveConfig() { g_shouldSaveConfig = true; }

void eraseSettings() {
  Serial.println(F("[setup] erasing settings"));
  wm.resetSettings();
  prefs.begin("nbus", false);
  prefs.clear();
  prefs.end();
  for (int i = 0; i < 6; ++i) { ledWrite(true); delay(80); ledWrite(false); delay(80); }
}

// Wipe Wi-Fi + MQTT settings when the BOOT button is held at power-on.
//
// GPIO9 doubles as the boot strapping pin that the USB host drives via DTR, so a
// serial terminal opening the port can pull it low a few hundred ms after the ROM
// has already sampled it high. Two gates make that harmless: the erase only runs
// after a true power-on reset (every USB-induced reset is excluded), and the pin
// must stay low for NBUS_FACTORY_HOLD_MS — far longer than any DTR pulse.
void maybeFactoryReset() {
  if (esp_reset_reason() != ESP_RST_POWERON) return;

  pinMode(NBUS_SETUP_BTN_PIN, INPUT_PULLUP);
  delay(50);
  if (digitalRead(NBUS_SETUP_BTN_PIN) != LOW) return;

  Serial.println(F("[setup] BOOT held — keep holding to erase settings"));
  const uint32_t start = millis();
  while (digitalRead(NBUS_SETUP_BTN_PIN) == LOW) {
    if (millis() - start >= NBUS_FACTORY_HOLD_MS) {
      eraseSettings();
      return;
    }
    ledWrite((((millis() - start) / 100) % 2) != 0);  // blink while counting
    delay(10);
  }
  ledWrite(false);
  Serial.println(F("[setup] BOOT released early — settings kept"));
}

// The ESP's disconnect reason is the only thing that separates a wrong passphrase
// (reason 15, 4-way handshake timeout) from an AP that refuses or drops us.
// Every line carries millis() so the association attempts can be lined up against the
// packet counters the router reports for this MAC.
void onWifiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_START:
      Serial.printf("[wifi %8lu] STA started\n", millis());
      break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      // Association + 4-way handshake done. Reaching this at all rules out the whole
      // authentication class of faults; only DHCP can still fail after this point.
      Serial.printf("[wifi %8lu] associated, ch %d, waiting for DHCP\n",
                    millis(), (int)info.wifi_sta_connected.channel);
      break;
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      Serial.printf("[wifi %8lu] got IP\n", millis());
      break;
    case ARDUINO_EVENT_WIFI_STA_LOST_IP:
      Serial.printf("[wifi %8lu] lost IP\n", millis());
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      Serial.printf("[wifi %8lu] disconnected, reason %d\n",
                    millis(), (int)info.wifi_sta_disconnected.reason);
      break;
    default:
      break;
  }
}

// Lists what the radio can actually see. The C3 is 2.4 GHz only, so an AP that is
// missing here but visible on a phone is almost always 5 GHz.
const char* authModeName(wifi_auth_mode_t m) {
  switch (m) {
    case WIFI_AUTH_OPEN:            return "open";
    case WIFI_AUTH_WEP:             return "WEP";
    case WIFI_AUTH_WPA_PSK:         return "WPA";
    case WIFI_AUTH_WPA2_PSK:        return "WPA2";
    case WIFI_AUTH_WPA_WPA2_PSK:    return "WPA/WPA2";
    case WIFI_AUTH_WPA2_ENTERPRISE: return "WPA2-ent";
    case WIFI_AUTH_WPA3_PSK:        return "WPA3";
    case WIFI_AUTH_WPA2_WPA3_PSK:   return "WPA2/WPA3";
    default:                        return "other";
  }
}

void logVisibleNetworks() {
  // Read from efuse, not WiFi.macAddress(): the driver is already stopped here and
  // would report all zeros.
  uint8_t mac[6] = {0};
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
  Serial.printf("[wifi] stored SSID '%s', STA MAC %02X:%02X:%02X:%02X:%02X:%02X, hostname %s\n",
                wm.getWiFiSSID().c_str(), mac[0], mac[1], mac[2], mac[3], mac[4], mac[5],
                NBUS_HOSTNAME);
  // Length and character mix of the stored passphrase, never the passphrase itself.
  // A mismatch with what was typed points at the portal form mangling a character.
  const String pass = wm.getWiFiPass();
  int nonAlnum = 0, nonAscii = 0;
  for (size_t i = 0; i < pass.length(); ++i) {
    const uint8_t c = (uint8_t)pass[i];
    if (c < 32 || c > 126) ++nonAscii;
    else if (!isalnum(c))  ++nonAlnum;
  }
  Serial.printf("[wifi] stored passphrase: %u chars, %d punctuation, %d non-ASCII\n",
                (unsigned)pass.length(), nonAlnum, nonAscii);

  const int n = WiFi.scanNetworks();
  Serial.printf("[wifi] %d networks visible (2.4 GHz only):\n", n);
  for (int i = 0; i < n; ++i) {
    Serial.printf("  %-28s ch%-3d %4d dBm %s\n", WiFi.SSID(i).c_str(), WiFi.channel(i),
                  WiFi.RSSI(i), authModeName(WiFi.encryptionType(i)));
  }
  WiFi.scanDelete();
}

// The portal never blocks: reading the bus is this device's primary job and must not
// depend on Wi-Fi being provisioned. loop() drives the portal via handleProvisioning().
void startProvisioning() {
  char portBuf[8];
  snprintf(portBuf, sizeof portBuf, "%u", cfg.port);
  pHost.setValue(cfg.host.c_str(), 64);
  pPort.setValue(portBuf, 8);
  pUser.setValue(cfg.user.c_str(), 48);
  pPass.setValue(cfg.pass.c_str(), 48);
  pBase.setValue(cfg.base.c_str(), 32);
  pOtaU.setValue(cfg.otaUser.c_str(), 32);
  pOtaP.setValue(cfg.otaPass.c_str(), 32);

  // Makes the device identifiable in the router's client list instead of showing up
  // as a nameless MAC address.
  wm.setHostname(NBUS_HOSTNAME);
  wm.setSaveConfigCallback(onSaveConfig);
  wm.setConfigPortalBlocking(false);
  // Bounds the one blocking step left in autoConnect(): the attempt on the saved AP.
  // Without it WiFiManager waits on the ESP's own result, which took 60 s on a failure.
  wm.setConnectTimeout(NBUS_WIFI_CONNECT_TIMEOUT_S);
  wm.addParameter(&pHost);
  wm.addParameter(&pPort);
  wm.addParameter(&pUser);
  wm.addParameter(&pPass);
  wm.addParameter(&pBase);
  wm.addParameter(&pOtaU);
  wm.addParameter(&pOtaP);

  if (wm.autoConnect(NBUS_AP_NAME)) {
    onWifiUp();
  } else {
    g_portalActive = true;
    Serial.printf("[wifi] connect failed (status %d) - portal %s open at 192.168.4.1\n",
                  (int)WiFi.status(), NBUS_AP_NAME);
    logVisibleNetworks();
  }
}

// ---------------------------------------------------------------------------
// MQTT settings page, served over the LAN on the device's own IP. The captive
// portal exists for first-time Wi-Fi setup only; changing the broker afterwards
// should not require dropping a working device back into AP mode.
// ---------------------------------------------------------------------------
String htmlEscape(const String& s) {
  String out;
  out.reserve(s.length() + 8);
  for (size_t i = 0; i < s.length(); ++i) {
    const char c = s[i];
    if      (c == '&') out += F("&amp;");
    else if (c == '<') out += F("&lt;");
    else if (c == '>') out += F("&gt;");
    else if (c == '"') out += F("&quot;");
    else if (c == '\'') out += F("&#39;");
    else               out += c;
  }
  return out;
}

