Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
void addField(String& p, const char* name, const char* label, const String& value,
              const char* type) {
  p += F("<label>");
  p += label;
  p += F("<input name='");
  p += name;
  p += F("' type='");
  p += type;
  p += F("' value='");
  p += htmlEscape(value);
  p += F("'></label>");
}

// --------------------------------------------------------------------------
// HTTP authentication
//
// These endpoints are reachable from the whole tailnet and from anyone on the
// camper LAN. /config can repoint the device at a different broker and /update
// replaces the firmware outright, so neither can stay open. The credentials are
// the ones already stored for ElegantOTA rather than a second set, because two
// passwords for one device is how one of them ends up forgotten.
//
// With no credentials configured the device stays open: a freshly provisioned
// unit has none yet, and locking it out of its own first configuration would
// need a USB cable to undo — the exact dependency this whole exercise removes.
// --------------------------------------------------------------------------
bool requireAuth() {
  if (cfg.otaUser.isEmpty()) return true;
  if (httpServer.authenticate(cfg.otaUser.c_str(), cfg.otaPass.c_str())) return true;
  httpServer.requestAuthentication();
  return false;
}

void handleConfigGet() {
  if (!requireAuth()) return;
  String p = F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
               "<title>N-Bus settings</title><style>"
               "body{font-family:sans-serif;max-width:24em;margin:2em auto;padding:0 1em}"
               "label{display:block;margin:.7em 0}"
               "input{width:100%;padding:.4em;box-sizing:border-box}"
               "button{padding:.6em 1.2em;margin-top:1em}</style>"
               "<h2>MQTT settings</h2><form method='POST'>");
  addField(p, "host", "Broker host (Home Assistant IP)", cfg.host, "text");
  addField(p, "port", "Port", String(cfg.port), "number");
  addField(p, "user", "Username", cfg.user, "text");
  addField(p, "pass", "Password (blank = keep current)", "", "password");
  addField(p, "base", "Base topic", cfg.base, "text");
  // Exposed here and not only in the setup portal: the portal needs the button held
  // on the physical device, and a credential you can only set by standing next to the
  // camper is no use for a box that is meant to be administered over the network.
  p += F("<h2>Access</h2><p style='font-size:.85em;color:#555'>Guards /config, /update "
         "and /raw. Leave the username blank to disable authentication.</p>");
  addField(p, "otau", "Username", cfg.otaUser, "text");
  addField(p, "otap", "Password (blank = keep current)", "", "password");
  p += F("<button type='submit'>Save &amp; reconnect</button></form>");
  httpServer.send(200, "text/html", p);
}

void handleConfigPost() {
  if (!requireAuth()) return;
  if (httpServer.hasArg("host")) cfg.host = httpServer.arg("host");
  if (httpServer.hasArg("port")) cfg.port = httpServer.arg("port").toInt();
  if (httpServer.hasArg("user")) cfg.user = httpServer.arg("user");
  // An empty password field means "unchanged", so the other fields can be edited
  // without having to retype the broker password.
  if (httpServer.arg("pass").length()) cfg.pass = httpServer.arg("pass");
  if (httpServer.hasArg("base")) cfg.base = httpServer.arg("base");
  if (httpServer.hasArg("otau")) cfg.otaUser = httpServer.arg("otau");
  if (httpServer.arg("otap").length()) cfg.otaPass = httpServer.arg("otap");
  if (cfg.port == 0) cfg.port = 1883;
  if (cfg.base.isEmpty()) cfg.base = NBUS_DEFAULT_BASE_TOPIC;
  saveConfig();
  Serial.printf("[cfg] saved MQTT %s:%u user '%s' base '%s', auth %s\n",
                cfg.host.c_str(), cfg.port, cfg.user.c_str(), cfg.base.c_str(),
                cfg.otaUser.isEmpty() ? "off" : "on");

  // Apply the new credentials at once. requireAuth() reads cfg directly and needs
  // nothing, but ElegantOTA keeps its own copy, so /update would otherwise stay on
  // the old setting until a reboot — the one endpoint where that gap matters most.
  if (cfg.otaUser.isEmpty()) ElegantOTA.clearAuth();
  else ElegantOTA.setAuth(cfg.otaUser.c_str(), cfg.otaPass.c_str());

  // Reconnect immediately with the new settings and re-announce discovery, so a
  // changed base topic reaches Home Assistant without a reboot.
  mqtt.disconnect();
  g_discoverySent = false;
  g_mqttFailCount = 0;
  g_lastMqttTryMs = 0;
  httpServer.send(200, "text/html",
                  F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
                    "<p>Saved — reconnecting to the broker.</p><p><a href='/config'>Back</a></p>"));
}

void onWifiUp() {
  if (g_shouldSaveConfig) {
    g_shouldSaveConfig = false;
    cfg.host = pHost.getValue();
    cfg.port = atoi(pPort.getValue());
    cfg.user = pUser.getValue();
    cfg.pass = pPass.getValue();
    cfg.base = pBase.getValue();
    cfg.otaUser = pOtaU.getValue();
    cfg.otaPass = pOtaP.getValue();
    if (cfg.port == 0) cfg.port = 1883;
    if (cfg.base.isEmpty()) cfg.base = NBUS_DEFAULT_BASE_TOPIC;
    saveConfig();
    Serial.println(F("[wifi] saved MQTT config"));
  }
  Serial.print(F("[wifi] connected, IP "));
  Serial.println(WiFi.localIP());

  // Deferred until now: the portal serves its own page on :80 while it is up.
  if (!cfg.otaUser.isEmpty()) {
    ElegantOTA.setAuth(cfg.otaUser.c_str(), cfg.otaPass.c_str());
  }
  httpServer.on("/", []() {
    httpServer.send(200, "text/html",
                    F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
                      "<h2>N-Bus camper bridge</h2>"
                      "<p><a href='/config'>MQTT settings</a></p>"
                      "<p><a href='/update'>Firmware update</a></p>"
                      "<p><a href='/status'>Status (JSON)</a></p>"
                      "<p><a href='/raw/dump'>Raw bus capture</a> &middot; "
                      "<a href='/raw/files'>saved dumps</a></p>"));
  });
  httpServer.on("/config", HTTP_GET, handleConfigGet);
  httpServer.on("/config", HTTP_POST, handleConfigPost);
  httpServer.on("/status",     HTTP_GET, handleStatus);
  httpServer.on("/raw/dump",   HTTP_GET, handleRawDump);
  httpServer.on("/raw/save",   HTTP_GET, handleRawSave);
  httpServer.on("/raw/files",  HTTP_GET, handleRawFiles);
  httpServer.on("/raw/file",   HTTP_GET, handleRawFile);
  ElegantOTA.begin(&httpServer);
  httpServer.begin();
  Serial.println(F("[ota] web server on :80 (/update)"));
  g_netServicesUp = true;

  mqttConnect();
}

void handleProvisioning() {
  if (!g_portalActive) return;
  if (wm.process()) {
    g_portalActive = false;
    wm.stopConfigPortal();  // frees port 80 before the OTA server binds to it
    onWifiUp();
  }
}

// --------------------------------------------------------------------------
// MQTT + Home Assistant discovery
// --------------------------------------------------------------------------
String statusTopic()  { return cfg.base + "/status"; }
String batteryTopic() { return cfg.base + "/battery"; }
String solarTopic()   { return cfg.base + "/solar"; }
String starterTopic() { return cfg.base + "/starter"; }

void addDevice(JsonObject dev) {
  JsonArray ids = dev["ids"].to<JsonArray>();
  ids.add(NBUS_DEVICE_ID);
  dev["name"] = NBUS_DEVICE_NAME;
  dev["mf"]   = NBUS_DEVICE_MF;
  dev["mdl"]  = NBUS_DEVICE_MDL;
}

void publishDiscoverySensor(const char* key, const char* name, const char* stateTopic,
                            const char* valTpl, const char* unit, const char* devCla,
                            const char* stateCla = "measurement") {
  JsonDocument doc;
  doc["name"]         = name;
  doc["uniq_id"]      = String(NBUS_DEVICE_ID) + "_" + key;
  doc["stat_t"]       = stateTopic;
  doc["val_tpl"]      = valTpl;
  if (unit && unit[0])   doc["unit_of_meas"] = unit;
  if (devCla && devCla[0]) doc["dev_cla"]    = devCla;
  if (stateCla && stateCla[0]) doc["stat_cla"] = stateCla;
  doc["avty_t"]       = statusTopic();
  addDevice(doc["dev"].to<JsonObject>());

