Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
  String topic = String(NBUS_HA_PREFIX) + "/sensor/" + NBUS_DEVICE_ID + "_" + key + "/config";
  String payload;
  serializeJson(doc, payload);
  mqtt.publish(topic.c_str(), payload.c_str(), true);
}

void publishDiscovery() {
  const String bt = batteryTopic();
  const String st = solarTopic();
  const String rt = starterTopic();

  publishDiscoverySensor("battery_soc",     "Leisure battery SoC",     bt.c_str(), "{{ value_json.soc }}",     "%", "battery");
  publishDiscoverySensor("battery_voltage", "Leisure battery voltage", bt.c_str(), "{{ value_json.voltage }}", "V", "voltage");
  publishDiscoverySensor("battery_current", "Leisure battery current", bt.c_str(), "{{ value_json.current }}", "A", "current");
  publishDiscoverySensor("battery_power",   "Leisure battery power",   bt.c_str(), "{{ value_json.power }}",   "W", "power");
  publishDiscoverySensor("cell1_voltage",   "Battery cell 1 voltage",  bt.c_str(), "{{ value_json.cells[0] }}", "V", "voltage");
  publishDiscoverySensor("cell2_voltage",   "Battery cell 2 voltage",  bt.c_str(), "{{ value_json.cells[1] }}", "V", "voltage");
  publishDiscoverySensor("cell3_voltage",   "Battery cell 3 voltage",  bt.c_str(), "{{ value_json.cells[2] }}", "V", "voltage");
  publishDiscoverySensor("cell4_voltage",   "Battery cell 4 voltage",  bt.c_str(), "{{ value_json.cells[3] }}", "V", "voltage");
  publishDiscoverySensor("battery_energy",   "Leisure battery energy remaining", bt.c_str(), "{{ value_json.energy }}",   "Wh", "energy_storage");
  publishDiscoverySensor("battery_quality",  "Leisure battery quality",          bt.c_str(), "{{ value_json.quality }}",  "%",  "");
  publishDiscoverySensor("battery_capacity", "Leisure battery capacity",         bt.c_str(), "{{ value_json.capacity }}", "Ah", "");
  // The battery reports its own runtime estimate in register 0x34; it is not derived
  // here. Only the half matching the current direction of travel is ever published.
  publishDiscoverySensor("battery_to_empty", "Leisure battery time to empty", bt.c_str(), "{{ value_json.to_empty }}", "min", "duration");
  publishDiscoverySensor("battery_to_full",  "Leisure battery time to full",  bt.c_str(), "{{ value_json.to_full }}",  "min", "duration");
  // Lifetime counters, so total_increasing rather than measurement: HA must not treat a
  // counter reset as a huge negative reading.
  publishDiscoverySensor("battery_discharged", "Leisure battery energy discharged", bt.c_str(),
                         "{{ value_json.discharged }}", "Wh", "energy", "total_increasing");
  publishDiscoverySensor("battery_charged",    "Leisure battery energy charged",    bt.c_str(),
                         "{{ value_json.charged }}",    "Wh", "energy", "total_increasing");
  publishDiscoverySensor("solar_voltage",   "Solar charger voltage",   st.c_str(), "{{ value_json.voltage }}", "V", "voltage");
  publishDiscoverySensor("solar_current",   "Solar charge current",    st.c_str(), "{{ value_json.current }}", "A", "current");
  publishDiscoverySensor("starter_voltage", "Starter battery voltage", rt.c_str(), "{{ value_json.voltage }}", "V", "voltage");
  Serial.println(F("[mqtt] discovery published"));
}

bool mqttConnect() {
  if (cfg.host.isEmpty()) return false;
  mqtt.setServer(cfg.host.c_str(), cfg.port);
  mqtt.setBufferSize(512);

  String clientId = String(NBUS_DEVICE_ID) + "-" + String((uint32_t)ESP.getEfuseMac(), HEX);
  const char* user = cfg.user.isEmpty() ? nullptr : cfg.user.c_str();
  const char* pass = cfg.pass.isEmpty() ? nullptr : cfg.pass.c_str();

  bool ok = mqtt.connect(clientId.c_str(), user, pass,
                         statusTopic().c_str(), 0, true, "offline");
  if (ok) {
    mqtt.publish(statusTopic().c_str(), "online", true);
    g_discoverySent = false;  // re-send discovery on (re)connect
    g_mqttFailCount = 0;
    Serial.println(F("[mqtt] connected"));
  } else {
    Serial.print(F("[mqtt] connect failed, state="));
    Serial.println(mqtt.state());
  }
  return ok;
}

// --------------------------------------------------------------------------
// State publishing
// --------------------------------------------------------------------------
void publishState() {
  const NBusState& s = parser.state();
  const uint32_t now = millis();

  // Battery
  if (s.batt_voltage_valid && (now - g_lastBattMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    if (s.batt_soc_valid)     doc["soc"]     = s.batt_soc;
    if (s.batt_voltage_valid) doc["voltage"] = roundf(s.batt_voltage * 100) / 100.0;
    if (s.batt_wh_valid)       doc["energy"]   = s.batt_wh;
    if (s.batt_quality_valid)  doc["quality"]  = s.batt_quality;
    if (s.batt_capacity_valid) doc["capacity"] = s.batt_capacity_ah;
    if (s.batt_to_empty_valid)  doc["to_empty"]   = s.batt_to_empty_min;
    if (s.batt_to_full_valid)   doc["to_full"]    = s.batt_to_full_min;
    if (s.batt_discharged_valid) doc["discharged"] = s.batt_discharged_wh;
    if (s.batt_charged_valid)    doc["charged"]    = s.batt_charged_wh;
    if (s.batt_current_valid) {
      doc["current"] = roundf(s.batt_current * 100) / 100.0;
      doc["power"]   = roundf(s.batt_voltage * s.batt_current * 10) / 10.0;
    }
    bool anyCell = s.cell_valid[0] || s.cell_valid[1] || s.cell_valid[2] || s.cell_valid[3];
    if (anyCell && (now - g_lastCellMs) < NBUS_STALE_MS) {
      JsonArray cells = doc["cells"].to<JsonArray>();
      for (int i = 0; i < 4; ++i) cells.add(roundf(s.cell_v[i] * 1000) / 1000.0);
    }
    String payload; serializeJson(doc, payload);
    mqtt.publish(batteryTopic().c_str(), payload.c_str(), true);
  }

  // Solar charger
  if (s.solar_valid && (now - g_lastSolarMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    doc["voltage"] = roundf(s.solar_voltage * 100) / 100.0;
    doc["current"] = roundf(s.solar_current * 100) / 100.0;
    String payload; serializeJson(doc, payload);
    mqtt.publish(solarTopic().c_str(), payload.c_str(), true);
  }

  // Starter battery
  if (s.starter_valid && (now - g_lastStarterMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    doc["voltage"] = roundf(s.starter_voltage * 100) / 100.0;
    String payload; serializeJson(doc, payload);
    mqtt.publish(starterTopic().c_str(), payload.c_str(), true);
  }
}

// --------------------------------------------------------------------------
// Raw register mirror
//
// Registers the parser understands become named sensors above. Everything else would
// otherwise be discarded, and that is precisely the data a post-mortem needs: on a
// healthy bus the candidate alarm registers (0xC0, 0xF0, 0xF1, 0xF2) are all zero, which
// looks exactly like an unused register. Only a capture taken while the fault is
// happening can tell those apart, and the fault is intermittent — so it has to be
// recorded continuously, unattended.
//
// Each pair gets its own retained topic, so the broker timestamps every change for free
// and a constant register costs one message ever. No discovery config is published:
// naming an entity would claim a meaning we have not established.
// --------------------------------------------------------------------------
struct RegMirror {
  uint8_t  nad = 0, reg = 0;
  uint8_t  data[4] = {0, 0, 0, 0};
  uint32_t lastPubMs = 0;
  bool     used = false;
};
