Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
// Stream the live ring. `?since=<ms>` returns only entries newer than that
// timestamp, which lets a poller follow the bus without the server holding the
// connection open — a long-lived stream would block loop(), and loop() is what
// drains the UART. Starving the reader to watch the reader would be perverse.
void handleRawDump() {
  if (!requireAuth()) return;
  const uint32_t since = httpServer.hasArg("since")
                       ? (uint32_t)strtoul(httpServer.arg("since").c_str(), nullptr, 10) : 0;
  httpServer.setContentLength(CONTENT_LENGTH_UNKNOWN);
  httpServer.send(200, "text/plain", "");

  char hdr[160];
  snprintf(hdr, sizeof(hdr),
           "# nbus raw dump v1\n# fw %s\n# now_ms %lu  frames %lu  total_seen %lu\n"
           "# t_ms NAD PCI SID REG D0 D1 D2 D3\n",
           NBUS_FW_VERSION, (unsigned long)millis(),
           (unsigned long)ringCount(), (unsigned long)g_ringTotal);
  httpServer.sendContent(hdr);

  String chunk;
  chunk.reserve(1700);
  char line[48];
  const uint32_t n = ringCount();
  uint32_t idx = ringOldest();
  for (uint32_t i = 0; i < n; ++i) {
    const RawEntry& e = g_ring[idx];
    idx = (idx + 1) % NBUS_RAW_RING_ENTRIES;
    if (e.ms <= since) continue;
    formatEntry(e, line, sizeof(line));
    chunk += line;
    if (chunk.length() > 1400) {
      httpServer.sendContent(chunk);
      chunk = "";
      esp_task_wdt_reset();
    }
  }
  if (chunk.length()) httpServer.sendContent(chunk);
  httpServer.sendContent("");
}

void handleRawSave() {
  if (!requireAuth()) return;
  rawPersist("manual");
  httpServer.send(200, "text/plain", "saved\n");
}

void handleRawFiles() {
  if (!requireAuth()) return;
  if (!g_fsReady) { httpServer.send(503, "text/plain", "fs unavailable\n"); return; }
  String out;
  File dir = LittleFS.open(NBUS_RAW_DUMP_DIR);
  for (File f = dir.openNextFile(); f; f = dir.openNextFile()) {
    out += f.name();
    out += '\t';
    out += String((uint32_t)f.size());
    out += '\n';
  }
  dir.close();
  httpServer.send(200, "text/plain", out.isEmpty() ? String("(none)\n") : out);
}

void handleRawFile() {
  if (!requireAuth()) return;
  if (!g_fsReady || !httpServer.hasArg("n")) {
    httpServer.send(400, "text/plain", "usage: /raw/file?n=<name>\n");
    return;
  }
  // Take only the basename: the argument indexes our own dump directory and is
  // never allowed to walk out of it.
  String name = httpServer.arg("n");
  int slash = name.lastIndexOf('/');
  if (slash >= 0) name = name.substring(slash + 1);
  const String path = String(NBUS_RAW_DUMP_DIR) + "/" + name;
  File f = LittleFS.open(path, "r");
  if (!f) { httpServer.send(404, "text/plain", "no such dump\n"); return; }
  httpServer.streamFile(f, "text/plain");
  f.close();
}

// --------------------------------------------------------------------------
// LIN frame capture (read-only)
// --------------------------------------------------------------------------
void markFresh(uint8_t nad, uint8_t reg) {
  const uint32_t now = millis();
  if (nad == NBUS_NAD_BATTERY) {
    g_lastBattMs = now;
    if (reg == 0x56 || reg == 0x57) g_lastCellMs = now;
  } else if (nad == NBUS_NAD_SOLAR) {
    if (reg == 0x01) g_lastStarterMs = now;
    else             g_lastSolarMs = now;
  }
}

void processFrameWindow(const uint8_t* buf, size_t len) {
#ifdef NBUS_DEBUG
  // Raw window dump: during bring-up this is what separates "nothing on the wire" from
  // "bytes arrive but framing is off".
  Serial.printf("[raw %2u]", (unsigned)len);
  for (size_t i = 0; i < len; ++i) Serial.printf(" %02X", buf[i]);
  Serial.println();
#endif
  // A frame window (delimited by an idle gap) holds: [break 0x00?] 0x55 PID data... checksum.
  for (size_t i = 0; i + 1 < len; ++i) {
    if (buf[i] != 0x55) continue;
    const uint8_t pid = buf[i + 1];
    if (pid != 0x7D) return;          // not a slave response; ignore this window
    const size_t dStart = i + 2;
    if (len - dStart < 8) return;     // not enough data bytes yet
    const uint8_t* d = &buf[dStart];

    // Optional checksum verification (classic checksum: data bytes only, PID excluded).
    if (len - dStart >= 9) {
      uint8_t expect = NBusParser::classicChecksum(d, 8);
      if (expect != d[8]) {
#ifdef NBUS_DEBUG
        Serial.printf("[lin] checksum mismatch reg=%02X exp=%02X got=%02X\n", d[3], expect, d[8]);
#endif
        return;
      }
    }

    // Record before dispatching. The ring is deliberately indiscriminate: a frame
    // the parser already understands is still evidence, and the registers we have
    // not decoded yet are exactly the ones a fault is most likely to show up in.
    ringPush(d);
    g_lastFrameMs = millis();

    if (parser.feedResponse(d, 8)) {
      markFresh(d[0], d[3]);
#ifdef NBUS_DEBUG
      Serial.printf("[lin] NAD %02X reg %02X : %02X %02X %02X %02X\n",
                    d[0], d[3], d[4], d[5], d[6], d[7]);
#endif
    } else if (d[1] == 0x06 && d[2] == 0xF4) {
      // A well-formed response the parser has no meaning for. Checksum and framing
      // already hold at this point, so it is real bus content, not noise — mirror it.
      mirrorRegister(d[0], d[3], &d[4]);
    }
    return;  // one response per window
  }
}

void readLin() {
  static uint8_t buf[NBUS_RX_BUF];
  static size_t  len = 0;
  static uint32_t lastByteUs = 0;

  while (LinSerial.available() > 0) {
    int b = LinSerial.read();
    if (b < 0) break;
    if (len < sizeof buf) buf[len++] = (uint8_t)b;
    lastByteUs = micros();
  }

  if (len > 0 && (micros() - lastByteUs) > NBUS_FRAME_GAP_US) {
    processFrameWindow(buf, len);
    len = 0;
  } else if (len >= sizeof buf) {
    processFrameWindow(buf, len);
    len = 0;
  }
}

// --------------------------------------------------------------------------
// Watchdog (Arduino-ESP32 core ≥ 3.x uses a config struct)
// --------------------------------------------------------------------------
void watchdogInit() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdt_cfg = {};
  wdt_cfg.timeout_ms = NBUS_WDT_TIMEOUT_S * 1000;
  wdt_cfg.idle_core_mask = 0;
  wdt_cfg.trigger_panic = true;
  esp_task_wdt_reconfigure(&wdt_cfg);  // TWDT already initialised by the core
  esp_task_wdt_add(NULL);
#else
  esp_task_wdt_init(NBUS_WDT_TIMEOUT_S, true);
  esp_task_wdt_add(NULL);
#endif
}

// --------------------------------------------------------------------------
// Arduino entry points
// --------------------------------------------------------------------------
void setup() {
  pinMode(NBUS_LED_PIN, OUTPUT);
  ledWrite(false);

