Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
  Serial.begin(115200);
  delay(200);
  Serial.printf("\n[boot] N-Bus ESP32-C3 firmware %s (%s)\n", NBUS_FW_VERSION, NBUS_FW_BUILD);

  maybeFactoryReset();
  loadConfig();
  // An unset broker host silently disables MQTT, which looks identical to a broker
  // that refuses the connection. Say which of the two it is.
  if (cfg.host.isEmpty()) {
    Serial.println(F("[cfg] no MQTT broker configured - set one at http://<device-ip>/config"));
  } else {
    Serial.printf("[cfg] MQTT %s:%u, user '%s', base '%s'\n",
                  cfg.host.c_str(), cfg.port, cfg.user.c_str(), cfg.base.c_str());
  }

  rawFsInit();

  // LIN UART: RX-only. TX pin is -1 — the bus is never driven.
  LinSerial.begin(NBUS_BAUD, SERIAL_8N1, NBUS_RX_PIN, NBUS_TX_PIN);
  Serial.printf("[lin] UART%d RX=GPIO%d @ %d 8N1 (read-only)\n",
                NBUS_UART_NUM, NBUS_RX_PIN, NBUS_BAUD);

  WiFi.onEvent(onWifiEvent);
  startProvisioning();
  watchdogInit();
}

void loop() {
  esp_task_wdt_reset();

  readLin();
  handleProvisioning();
  if (g_netServicesUp) {
    httpServer.handleClient();
    ElegantOTA.loop();
  }

  // MQTT keepalive + non-blocking reconnect.
  if (mqtt.connected()) {
    mqtt.loop();
  } else if (WiFi.status() == WL_CONNECTED && !cfg.host.isEmpty() &&
             (millis() - g_lastMqttTryMs) > NBUS_MQTT_RETRY_MS) {
    g_lastMqttTryMs = millis();
    if (!mqttConnect()) {
      if (++g_mqttFailCount >= 60) {  // ~5 min of failures → reboot
        Serial.println(F("[mqtt] too many failures — rebooting"));
        delay(200);
        ESP.restart();
      }
    }
  }

  // Discovery once per connection, then throttled state publishing.
  if (mqtt.connected()) {
    if (!g_discoverySent) {
      publishDiscovery();
      g_discoverySent = true;
    }
    if (millis() - g_lastPublishMs > NBUS_PUBLISH_MS) {
      g_lastPublishMs = millis();
      publishState();
    }
  }

  // Bus silence is the trigger for everything this device was built to catch.
  // On a powerbank the ESP outlives the fault, so there is no rush and no need
  // for a brownout handler: the bus simply stops answering and we calmly write
  // the preceding minutes to flash. Edge-triggered — one dump per silence, not
  // one per loop — and re-armed only once frames actually resume.
  if (g_lastFrameMs) {
    const uint32_t age = millis() - g_lastFrameMs;
    if (!g_busSilent && age > NBUS_RAW_SILENCE_MS) {
      g_busSilent = true;
      Serial.printf("[raw] bus silent for %lu ms — persisting ring\n", (unsigned long)age);
      rawPersist("bus silent");
    } else if (g_busSilent && age < NBUS_RAW_SILENCE_MS) {
      g_busSilent = false;
      Serial.println(F("[raw] bus is back"));
    }
  }

  // Heartbeat: brief blink each second.
  if (millis() - g_lastHeartbeatMs > NBUS_HEARTBEAT_MS) {
    g_lastHeartbeatMs = millis();
    ledWrite(true);
    delay(5);
    ledWrite(false);
  }
}
